app/Controllers/AuthController.php

SELECT *
FROM "users"
WHERE "users"."student_id" = 'D20211097851'
---
    public function login()
    {
        $student_id = $this->request->getPost('student_id');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->find($student_id);