app/Controllers/JobRecommendationsController.php

SELECT *
FROM "student_subjects"
WHERE "student_id" = 'D20211097851'
SELECT *
FROM "subject_job_mapping"
WHERE "subject_code" = 'DEP3063'
---
    public function index()
    {
        $student_id = session()->get('student_id');

        if (!$student_id) {
            return redirect()->to('/login')->with('error', 'Please log in first.');
        }

        $studentSubjectsModel = new StudentSubjectsModel();
        $subjectJobMappingModel = new SubjectJobMappingModel();
        $jobModel = new JobModel();

        // Fetch all student subjects
        $studentSubjects = $studentSubjectsModel->where('student_id', $student_id)->findAll();

        if (empty($studentSubjects)) {
            return view('sections/job_recommendations', [
                'jobRecommendations' => [],
                'message' => 'No subjects added yet.'
            ]);
        }

        // Prepare job recommendations
        $jobRecommendations = [];
        foreach ($studentSubjects as $subject) {
            // Get all mappings for the current subject code
            $mappings = $subjectJobMappingModel->where('subject_code', $subject['subject_code'])->findAll();