app/Controllers/StudentSubjectsController.php

SELECT *
FROM "subject_skills"
WHERE "subject_code" LIKE '%D%' ESCAPE '!'
OR  "subject_name" LIKE '%D%' ESCAPE '!'
---
    public function search()
    {
        $keyword = $this->request->getPost('keyword');
        $subjectSkillsModel = new SubjectSkillsModel();

        $subjects = $subjectSkillsModel
            ->like('subject_code', $keyword)
            ->orLike('subject_name', $keyword)
            ->findAll();

SELECT *
FROM "student_subjects"
WHERE "student_id" = 'D20211097851'
AND "subject_code" = 'DEP3063'
 LIMIT 1
SELECT *
FROM "subject_job_mapping"
WHERE "subject_code" = 'DEP3063'
 LIMIT 1
SELECT *
FROM "subject_skills"
WHERE "subject_code" = 'DEP3063'
 LIMIT 1
---
    public function add()
    {
        $student_id = session()->get('student_id');
        $subject_code = $this->request->getPost('subject_code');
        $grade = $this->request->getPost('grade'); // Fetch the submitted grade

        if (!$student_id || !$subject_code || !$grade) {
            return redirect()->back()->with('error', 'Invalid input provided. Please ensure all fields are filled.');
        }

        $studentSubjectsModel = new StudentSubjectsModel();
        $existing = $studentSubjectsModel->where('student_id', $student_id)
                                         ->where('subject_code', $subject_code)
                                         ->first();

        if ($existing) {
            return redirect()->back()->with('error', 'Subject already added.');
        }

        $subjectJobMappingModel = new SubjectJobMappingModel();
        $mapping = $subjectJobMappingModel->where('subject_code', $subject_code)->first();

        if (!$mapping) {
            return redirect()->back()->with('error', 'No job mapping found for this subject.');
        }

        $job_id = $mapping['job_id'];

        $subjectSkillsModel = new SubjectSkillsModel();
        $subject = $subjectSkillsModel->where('subject_code', $subject_code)->first();

INSERT INTO "student_subjects" ("student_id", "subject_code", "job_id", "technical_skills", "soft_skills", "knowledge", "grade", "recommendation_level") VALUES ('D20211097851', 'DEP3063', '5', '', 'Communication,Teamwork,Problem-Solving,Time Management', 'Waterfall Model,Spiral Model,Incremental Model,Iterative Model,Prototype Model,V Model,RAD Model,Agile Model,Feature Driven Development,Integration Model,ADDIE Model,Formative Evaluation,Summative Evaluations', 'A', 'Highly Recommended')
---
            'recommendation_level' => $recommendation_level,
        ];

        if ($studentSubjectsModel->insert($data)) {

DELETE FROM "student_subjects"
WHERE "id" IN ('40')
---
    public function delete($id)
    {
        $studentSubjectsModel = new StudentSubjectsModel();

        if ($studentSubjectsModel->delete($id)) {

SELECT *
FROM "student_subjects"
WHERE "student_id" = 'D20211097851'
---
    public function skill()
    {
        $student_id = session()->get('student_id');
        $studentSubjectsModel = new StudentSubjectsModel();

        $skills = $studentSubjectsModel->where('student_id', $student_id)->findAll();