app/Controllers/StudentProfileController.php

    public function index()
    {
        $student_id = session()->get('student_id'); // Get the logged-in student's ID
        $profileModel = new StudentProfileModel();

        $profile = $profileModel->where('student_id', $student_id)->first(); // Fetch profile
---
SELECT *
FROM "student_profiles"
WHERE "student_id" = 'D20211097851'
 LIMIT 1

    public function edit($student_id)
    {
        $loggedInStudentId = session()->get('student_id'); // Ensure the student can only edit their own profile

        if ($student_id !== $loggedInStudentId) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('You can only edit your own profile.');
        }

        $profileModel = new StudentProfileModel();

        $profile = $profileModel->where('student_id', $student_id)->first(); // Fetch profile
---
SELECT *
FROM "student_profiles"
WHERE "student_id" = 'D20211097851'
 LIMIT 1