app/Models/StudentSubjectsModel.php

    public function getStudentSubjects($student_id)
    {
        // Ensure correct column names in the database schema
        return $this->select('
                    student_subjects.subject_code AS code,
                    subject_skills.subject_name AS name,
                    subject_skills.credit_hours,
                    student_subjects.technical_skills,
                    student_subjects.soft_skills,
                    student_subjects.knowledge,
                    student_subjects.grade,
                    student_subjects.recommendation_level,
                    student_subjects.id
                ')
                ->join('subject_skills', 'subject_skills.subject_code = student_subjects.subject_code', 'inner')
                ->where('student_subjects.student_id', $student_id)
                ->findAll();
---
SELECT "student_subjects"."subject_code" AS "code", "subject_skills"."subject_name" AS "name", "subject_skills"."credit_hours", "student_subjects"."technical_skills", "student_subjects"."soft_skills", "student_subjects"."knowledge", "student_subjects"."grade", "student_subjects"."recommendation_level", "student_subjects"."id"
FROM "student_subjects"
INNER JOIN "subject_skills" ON "subject_skills"."subject_code" = "student_subjects"."subject_code"
WHERE "student_subjects"."student_id" = 'D20211097851'